tap "homebrew/bundle"
tap "supabase/tap"
tap "zurawiki/brews"
brew "libpng"
brew "asciinema"
brew "atuin"
brew "bash-preexec"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "btop"
brew "libx11"
brew "cheat"
brew "chezmoi"
brew "cloc"
brew "codespell"
brew "commitizen"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "glab"
brew "glfw"
brew "gnupg"
brew "htop"
brew "jq"
brew "kondo"
brew "lazygit"
brew "sdl2"
brew "libtcod"
brew "mise"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "pre-commit"
brew "pyenv"
brew "python@3.12"
brew "ripgrep"
brew "rsync"
brew "rust-analyzer"
brew "sdl2_image"
brew "sdl2_ttf"
brew "sdl3"
brew "sdl3_image"
brew "shellcheck"
brew "starship"
brew "taplo"
brew "tcl-tk"
brew "topgrade"
brew "treefmt"
brew "uv"
brew "winetricks"
brew "yq"
brew "zellij"
brew "zenity"
brew "zlib"
brew "zoxide"
brew "supabase/tap/supabase"
brew "zurawiki/brews/gptcommit"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "gstreamer-runtime"
cask "kitty"
cask "wine-stable"
vscode "aaravb.chrome-extension-developer-tools"
vscode "alefragnani.project-manager"
vscode "arcanis.vscode-zipfs"
vscode "arturock.gitstash"
vscode "bierner.markdown-preview-github-styles"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "huizhou.githd"
vscode "ibecker.treefmt-vscode"
vscode "joaopalmeiro.icons-octicons"
vscode "johnnymorganz.stylua"
vscode "kampfkarren.selene-vscode"
vscode "khaled.vscode-openrouter-extension"
vscode "ldez.ignore-files"
vscode "mattpocock.ts-error-translator"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "rvest.vs-code-prettier-eslint"
vscode "saoudrizwan.claude-dev"
vscode "shaharkazaz.git-merger"
vscode "sonarsource.sonarlint-vscode"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "tailscale.vscode-tailscale"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "thertzlor.semantic-rainbow"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
